tutorials/heatTransfer/chtMultiRegionSimpleFoam/multiRegionHeater/system/heater/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    boundary
    {
        minY
        {
            type            patch;
        }
        minZ
        {
            type            patch;
        }
        maxZ
        {
            type            patch;
        }
    }

    T
    {
        internalField   uniform 300;

        boundaryField
        {
            ".*"
            {
                type            zeroGradient;
                value           uniform 300;
            }
            "heater_to_.*"
            {
                type            compressible::turbulentTemperatureCoupledBaffle;
                neighbourFieldName T;
                Kappa               Kappa;
                value           uniform 300;
            }
            minY
            {
                type            fixedValue;
                value           uniform 500;
            }
        }
    }

    rho
    {
        internalField   uniform 8000;

        boundaryField
        {
            ".*"
            {
                type            calculated;
                value           uniform 8000;
            }
        }
    }

    Kappa
    {
        internalField   uniform 80;

        boundaryField
        {
            ".*"
            {
                type            zeroGradient;
                value           uniform 80;
            }
        }
    }

    cp
    {
        internalField   uniform 450;

        boundaryField
        {
            ".*"
            {
                type            zeroGradient;
                value           uniform 450;
            }
        }
    }
}

// ************************************************************************* //
